Autodesk.Revit.DB.CompoundStructureError
When CompoundStructure::isValid() returns false, it uses these values to indicate precise nature of defect.
Remarks:
'LayerTooThin' enum value was removed in 2016
Since:
2012

Autodesk.Revit.DB.CompoundStructureError.InvalidProfileId
Element id used as profile id does not correspond to a valid deck profile.

Autodesk.Revit.DB.CompoundStructureError.ExtensibleRegionsNotContiguousAlongBottom
Extension Layers at the bottom of the wall must be adjacent.

Autodesk.Revit.DB.CompoundStructureError.ExtensibleRegionsNotContiguousAlongTop
Extension Layers at the top of the wall must be adjacent.

Autodesk.Revit.DB.CompoundStructureError.InvalidMaterialId
Element id used as material id does not correspond to an actual MaterialElem.

Autodesk.Revit.DB.CompoundStructureError.VarThickLayerCantBeZero
Variable thickness layer have zero thickness.

Autodesk.Revit.DB.CompoundStructureError.DeckCantBoundBelow
There is no layer below Structural deck or it is too thin.

Autodesk.Revit.DB.CompoundStructureError.DeckCantBoundAbove
There is no layer above Structural deck or it is too thin.

Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderMembrane
Membrane Layer have more than one face at any height.

Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderCoreInterior
Interior core boundary have more than one face at any height.

Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderCoreExterior
Exterior core boundary have more than one face at any height.

Autodesk.Revit.DB.CompoundStructureError.VerticalWrongOrderLayer
Layers assigned to the same Row are not on the same side of the Core Boundary.

Autodesk.Revit.DB.CompoundStructureError.VerticalUnusedLayer
A layer is not membrane layer and the Thickness of layer is zero.

Autodesk.Revit.DB.CompoundStructureError.ThinOuterLayer
Thickness of face layer is too thin.

Autodesk.Revit.DB.CompoundStructureError.BadShellsStructure
The number of shell layers is larger than the total number of layers.

Autodesk.Revit.DB.CompoundStructureError.NonmembraneTooThin
Thickness of non-membrane layer is too thin.

Autodesk.Revit.DB.CompoundStructureError.MembraneTooThick
Thickness of membrane layer is more than zero.

Autodesk.Revit.DB.CompoundStructureError.CoreTooThin
Core contain a membrane layer or thickness of core is zero.

Autodesk.Revit.DB.CompoundStructureError.BadShellOrder
Layer Function Priorities ascend from the Core Boundary to the Finish Face.